[
  {
    "number": 1211,
    "title": "cline checkpoints results in constant password prompts if commit signing is enabled",
    "created_at": "2025-01-09T10:17:22Z",
    "closed_at": "2025-01-09T21:51:48Z",
    "labels": [],
    "url": "https://github.com/cline/cline/issues/1211",
    "body": "### What happened?\n\nOnce I upgraded cline to 3.1.0 I started getting popups about my gpg password after every cline action. This is rather disrupting. The reason is that we sign commits by default and cline creates checkpoint commits using the default git configuration, so it also tries to sign every commit. It would be nice to either have a way to disable checkpoint feature, or prevent git from using global config by setting `GIT_CONFIG_GLOBAL=/dev/null` when calling git to commit the checkpoint.\n\n### Steps to reproduce\n\n1. enable commit signing in the default git config using: `git config --global commit.gpgSign true`. You also need gpg to be configured.\r\n2. try using cline, you should see pop-ups for a password on every step\r\n\r\n\n\n### Relevant API REQUEST output\n\n_No response_\n\n### Operating System\n\nMacOS\n\n### Cline Version\n\n3.1.2\n\n### Additional context\n\n_No response_",
    "comments_url": "https://api.github.com/repos/cline/cline/issues/1211/comments",
    "author": "shaydo-deriv",
    "comments": [
      {
        "user": "saoudrizwan",
        "created_at": "2025-01-09T21:51:49Z",
        "body": "I just pushed v3.1.4 that disables `gpgSigning` in the shadow git repo. Please LMK if that fixes the issue for you, and feel free to reopen if not."
      }
    ],
    "satisfaction_conditions": [
      "Prevents GPG password prompts during cline checkpoint operations",
      "Maintains global commit signing configuration for regular user commits",
      "Does not require manual git configuration overrides by end users",
      "Preserves checkpoint functionality while addressing signing issue"
    ],
    "_classification": {
      "category": "Requires build environment but hard to be dockerized",
      "timestamp": "2025-04-05 01:50:03"
    }
  },
  {
    "number": 415,
    "title": "Bug: You might want to check Openrouter Claude 3.5 Sonnet prompt caching in latest version",
    "created_at": "2024-09-27T19:30:12Z",
    "closed_at": "2024-10-11T02:20:20Z",
    "labels": [
      "Bug"
    ],
    "url": "https://github.com/cline/cline/issues/415",
    "body": "### Which API Provider are you using?\n\nOpenRouter\n\n### Which Model are you using?\n\n Claude 3.5 Sonnet\n\n### What happened?\n\nI could be wrong, but it seems as if prompt caching isn't working like it did in previous versions. I'm spending on tokens much faster, it seems. \n\n### Steps to reproduce\n\n1.Test caching compared to previous versions.\r\n2.\r\n3.\r\n\n\n### Relevant API REQUEST output\n\n_No response_\n\n### Additional context\n\n_No response_",
    "comments_url": "https://api.github.com/repos/cline/cline/issues/415/comments",
    "author": "techcow2",
    "comments": [
      {
        "user": "alexwohletz",
        "created_at": "2024-09-28T18:40:41Z",
        "body": "I'm having the same issue."
      },
      {
        "user": "CodemiteX",
        "created_at": "2024-09-30T16:28:03Z",
        "body": "Using v1.9.7 of Claude Dev using Sonnet3.5 with OpenRouter.   The Agent has a tendency to remove code blocks that have nothing to do with suggested edits.  The Cache Count seems to rise and bill keeps going up but it acts like it doesn't know what it just did. It keeps apologizing and has to then add in the deleted code it erased. this is costing allot of tokens. I went through the troubleshooting section and tried to address it that way but it seems to happen every time and becomes taxing. Claude Website and OpenAI chat sessions seem to handle it better. This tool has a long way to go to handle existing code bases that more than a few classes.  \r\n\r\nSAMPLE RESPONSE:\r\nI apologize for the oversight. It seems that some methods were accidentally removed or not included in our previous update. Let's add the missing methods back to the BackgroundService.cs file. I'll update the file with the missing methods while keeping our previous changes intact."
      },
      {
        "user": "techcow2",
        "created_at": "2024-10-01T11:12:54Z",
        "body": "> Using v1.9.7 of Claude Dev using Sonnet3.5 with OpenRouter. The Agent has a tendency to remove code blocks that have nothing to do with suggested edits. The Cache Count seems to rise and bill keeps going up but it acts like it doesn't know what it just did. It keeps apologizing and has to then add in the deleted code it erased. this is costing allot of tokens. I went through the troubleshooting section and tried to address it that way but it seems to happen every time and becomes taxing. Claude Website and OpenAI chat sessions seem to handle it better. This tool has a long way to go to handle existing code bases that more than a few classes.\r\n> \r\n> SAMPLE RESPONSE: I apologize for the oversight. It seems that some methods were accidentally removed or not included in our previous update. Let's add the missing methods back to the BackgroundService.cs file. I'll update the file with the missing methods while keeping our previous changes intact.\r\n\r\nThis needs to go in a separate issue."
      },
      {
        "user": "Shirryon",
        "created_at": "2024-10-03T02:13:52Z",
        "body": "Having the same issue. 3.5 Sonnet without caching goes by way too fast. Also, there's no information about the caching itself, compared with the API provided by Claude."
      },
      {
        "user": "muratgokturk",
        "created_at": "2024-10-07T06:40:20Z",
        "body": "It's definitely a big problem and everybody has it."
      },
      {
        "user": "saoudrizwan",
        "created_at": "2024-10-11T02:20:20Z",
        "body": "v2.0 fixes some issues around openrouter prompt caching. Please give it a try and let me know if you're still seeing problems. Keep in mind that the cache will still break in certain situations: when an image is added to chat, if 5 minutes has passed since the last message, if you hit the context window limit and the extension has to truncate your message history to keep the conversation going."
      },
      {
        "user": "techcow2",
        "created_at": "2024-10-11T03:19:22Z",
        "body": "@saoudrizwan appears fixed to me!"
      }
    ],
    "satisfaction_conditions": [
      "Demonstrates effective prompt caching behavior with OpenRouter's Claude 3.5 Sonnet",
      "Maintains consistent context retention across multiple interactions",
      "Clarifies cache invalidation triggers specific to OpenRouter integration",
      "Matches Claude's native API context handling capabilities"
    ],
    "_classification": {
      "category": "Requires build environment but hard to be dockerized",
      "timestamp": "2025-04-05 01:50:49"
    }
  }
]