[
  {
    "number": 31,
    "title": "Clarification on Frontend and Backend Compatibility with Multiple Models",
    "created_at": "2024-09-24T16:40:13Z",
    "closed_at": "2024-09-27T06:48:11Z",
    "labels": [
      "question"
    ],
    "url": "https://github.com/av/harbor/issues/31",
    "body": "I have a few questions regarding frontend and backend compatibility:\r\n\r\n1. Frontend-Backend Compatibility: Does any frontend work with any backend? I noticed that most backends are designed to work with GGUF models, but this project seems to support various backends, including vLLM, Mistral.rs, etc. If I select one of these backends, will it be compatible with frontends like Open WebUI and other similar platforms?\r\n2. Closed-Source Frontend Support: Currently, I have a closed-source frontend that is only compatible with GGUF models. If I choose to use this project, is it possible to expose a backend that my closed-source frontend can consume, allowing it to support multiple types of backends?\r\n\r\nI’d appreciate any guidance or clarification on these points!",
    "comments_url": "https://api.github.com/repos/av/harbor/issues/31/comments",
    "author": "bhupesh-sf",
    "comments": [
      {
        "user": "av",
        "created_at": "2024-09-24T16:59:23Z",
        "body": "Thanks for trying out Harbor!\r\n\r\n1. It's only mentioned in the docs implicitly, but the support is not complete (nor it could be, to be fair)\r\n\r\nThe policy is to support everything for the main default UI and default Backend. I.e. - integrate all UIs with the default backend and all UIs with the default backend. Anything else is considered extra and provided on the best effort basis (contributions are very welcomed!)\r\n\r\nThis is not to discourage you in any way - plenty of services combinations work out of the box, the best way to check is to lookup the `x` files to see if there's an intersection.\r\n\r\n2. All the Harbor services that expose the APIs can be used with external clients. See docs on the `harbor url` / `harbor qr` commands"
      },
      {
        "user": "bhupesh-sf",
        "created_at": "2024-09-27T01:32:57Z",
        "body": "Thanks for the answer, it does clarifies 👍🏻 "
      },
      {
        "user": "av",
        "created_at": "2024-09-27T06:48:11Z",
        "body": "Awesome, feel free to reopen if needed"
      }
    ],
    "satisfaction_conditions": [
      "Clarification of compatibility policies between frontends and backends beyond default configurations",
      "Explanation of API exposure capabilities for external frontends",
      "Acknowledgement of best-effort support for non-default configurations"
    ],
    "_classification": {
      "category": "Does not need build environment",
      "timestamp": "2025-04-05 01:57:12"
    }
  }
]