[
  {
    "number": 8869,
    "title": "Move out Storybook into it's own workspace",
    "created_at": "2022-01-11T15:57:27Z",
    "closed_at": "2022-01-27T10:20:02Z",
    "labels": [
      "enhancement",
      "good first issue",
      "help wanted"
    ],
    "url": "https://github.com/backstage/backstage/issues/8869",
    "body": "We've got a real issue with upgrading certain dependencies, looking at you webpack 👀 , because we have two different versions of webpack v4, and v5 running side by side, and the types are all over the place for the webpack plugins and libraries.\r\n\r\nWe have a stable build right now, but trying to upgrade dependencies #8793 #8548 are proving to be a massive time sink as we need to get the correct modules installed in the correct places for our typescript build to pass with `skipLibCheck: false`.\r\n\r\nNot hoisting the packages from the `storybook` workspace has worked for now, but it would be really nice if we just had one version of webpack and all the dev-server dependencies in the project.\r\n\r\nUntil storybook starts to use v5 out of the box, there's little we can do, as you can use v5 with storybook, but it will also try and bring in v5 which makes the whole thing even worse.\r\n\r\nLet's move out Storybook into it's own yarn workspaces, that requires a seperate yarn install to get up and running and would install things in `storybook/node_modules` seperate with it's own yarn.lock.\r\n\r\nMaybe there's also a possibility to skip the build tooling of storybook entirely and just get it to generate something that we can hook into our own build system instead.",
    "comments_url": "https://api.github.com/repos/backstage/backstage/issues/8869/comments",
    "author": "benjdlambert",
    "comments": [
      {
        "user": "snehaljos",
        "created_at": "2022-01-12T12:34:59Z",
        "body": "hi am interested to work on it but I need some help can I work  on it?"
      },
      {
        "user": "benjdlambert",
        "created_at": "2022-01-27T10:20:18Z",
        "body": "So I think it should be a case of removing `storybook` from `packages` and placing it at the root level under `storybook/` and then making sure that all the stories still work, and that any workflows that run storybook need to do a `yarn install` in the `storybook` directory as well as a normal `yarn install`. Feel free to go ahead and see if you can get this working, maybe there could also be other dragons which make this a little tricky and not a `good first issue`. 😅 \n\n---\n\nFixed! Thanks @snehaljos!"
      }
    ],
    "satisfaction_conditions": [
      "Complete isolation of Storybook dependencies from core project dependencies",
      "Maintained Storybook functionality with working stories",
      "Independent dependency management for Storybook workspace",
      "Preservation of existing build system integration",
      "Clear documentation for workspace setup requirements"
    ],
    "_classification": {
      "category": "Can be dockerized without any issue",
      "timestamp": "2025-04-04 23:47:53"
    }
  }
]