[
  {
    "number": 302,
    "title": "Game was protected. But cannot dump it. Is there anyway to solve?",
    "created_at": "2020-05-30T18:06:26Z",
    "closed_at": "2020-06-21T18:30:21Z",
    "labels": [
      "question"
    ],
    "url": "https://github.com/Perfare/Il2CppDumper/issues/302",
    "body": "Dear everyone,\r\n\r\nI got a game which protected binary file. But when i use gameguardian to dump it, game crash immediately. Is there anyway to bypass this?\r\n\r\nPlease help me",
    "comments_url": "https://api.github.com/repos/Perfare/Il2CppDumper/issues/302/comments",
    "author": "mrcas",
    "comments": [
      {
        "user": "Perfare",
        "created_at": "2020-06-18T17:30:37Z",
        "body": "Please confirm that you have checked the gameguardian hidden."
      },
      {
        "user": "mrcas",
        "created_at": "2020-06-18T17:34:51Z",
        "body": "I tried lot of ways but still cannot do anything. Or maybe i do something wrong.\r\n\r\nI tried to freeze the game when dump. But the dump file is not correct. I want to learn new experience to solve this case. Please help me.\r\n\r\n"
      },
      {
        "user": "Perfare",
        "created_at": "2020-06-19T22:51:49Z",
        "body": "I have tested that if check the 4 hidden options of gameguardian, can dump normally.\r\nBut for the file after dump, you need to copy the elf header from the source so file, then edit the PHT header, set the offset and vaddr values of the two Loadable Segments to 0, and set filesz and memsz to the so file size."
      },
      {
        "user": "mrcas",
        "created_at": "2020-06-21T12:43:47Z",
        "body": "Thanks for your help. I solved it.\n\n---\n\nDear Perfare,\r\n\r\nSorry for disturbing you. I noticed that after dump, i just need to edit ELF header and Il2CppDumper can dump normally. Is it any wrong? It seems this game have anti patch too. When i patched in runtime, game freezed.\n\n---\n\nThanks again Perface. I solved the problem now :D. Thanks for teaching me."
      },
      {
        "user": "Perfare",
        "created_at": "2020-06-21T18:30:21Z",
        "body": "Okay, I will close this issue. If you have other issues, you can open a new."
      }
    ]
  }
]