[
  {
    "number": 20645,
    "title": "Docker networks break when DBeaver is running",
    "created_at": "2023-07-22T16:36:15Z",
    "closed_at": "2023-07-28T12:41:43Z",
    "labels": [
      "question",
      "xf:connection"
    ],
    "url": "https://github.com/dbeaver/dbeaver/issues/20645",
    "body": "### Description\n\nWhen all the services have been started with docker compose, running DBeaver won't cause any problem.\r\nIf we want to update the services after a build or a down of the services with a simple docker compose up and DBeaver is running, the services cannot access the docker DNS server (to resolve other services IPs from their names).\r\n\r\nIt looks like it is something from a recent update of DBeaver because the problem didn't appear before.\n\n### DBeaver Version\n\n23.1.2.202307091549\n\n### Operating System\n\nWindows 10 22H2 Build 19045.3208\n\n### Database and driver\n\n_No response_\n\n### Steps to reproduce\n\n1. Launch DBeaver\r\n2. Launch Docker Compose project (with one service accessing an other one)\r\n3. Observe the service accessing the other one failing to reach the Docker DNS server with error message: `querying server version dial tcp: lookup database on 127.0.0.11:53: server misbehaving`\n\n### Additional context\n\n_No response_",
    "comments_url": "https://api.github.com/repos/dbeaver/dbeaver/issues/20645/comments",
    "author": "AlexDsv",
    "comments": [
      {
        "user": "E1izabeth",
        "created_at": "2023-07-22T17:04:14Z",
        "body": "Could you specify the version you didn't experience the described behaviour with?"
      },
      {
        "user": "AlexDsv",
        "created_at": "2023-07-23T13:15:40Z",
        "body": "I was using DBeaver 22.3.5 before updating to the latest version and I never experienced this behaviour."
      },
      {
        "user": "E1izabeth",
        "created_at": "2023-07-27T13:31:58Z",
        "body": "Are you connecting to some database when you launching DBeaver?\n\n---\n\nCould you verify that there is no open connections and try to reproduce it this way?"
      },
      {
        "user": "AlexDsv",
        "created_at": "2023-07-28T12:39:57Z",
        "body": "I disabled \"Connect on editor activation\" and \"Reopen database editors after restart\" and it fixed the issue.\r\n\r\nThanks for the help ! "
      }
    ],
    "satisfaction_conditions": [
      "Prevent DBeaver from automatically opening database connections during startup",
      "Ensure DBeaver's network activity doesn't interfere with Docker's internal DNS resolution"
    ],
    "_classification": {
      "category": "Requires build environment but hard to be dockerized",
      "timestamp": "2025-04-04 23:59:00"
    }
  }
]